git-primer.org
#+TITLE: Yet Another Git Primer
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+EXPORT_FILE_NAME: index.html
#+OPTIONS: num:nil date:nil

* What is git and why should we use it?
#+begin_center
# xkcd:1597
#+end_center

When you're working on a file or a document, it is important to save frequently in order to make sure you don't lose your work. But code is complicated. The development of code is not linear - often edits are exploratory and end up being reverted. You find quickly that what you want to be able to save and explore is not the actual state of your files, but the sequence of edits you've made. ~git~ saves your project as a sequence of edits to your code base rather than a set of file contents.

** Motivation: Checkpoints
You have been writing code for hours. You've got into a good flow. What started off as a few functions in a single file has expanded into dozens of functions and classes in half a dozen files each consisting of several hundred lines of code. At least. You save the latest line you wrote. After The Great Cherry Coke Debacle in freshman year where you lost two pages of your final paper hours before the deadline, you're very diligent about saving. But it has started to occur to you - not all saves are created equal. Saving code might have one of several purposes:

- To ensure that you don't lose what you've done.
- To compile and run your code as a sanity check.
- To mark a checkpoint in your progress - a version of your code to backup and come back to if things break.

In a smaller, simpler project, you might have just copied the code into a different folder now and then. But what if you want to go back several checkpoints? or what if you forget? What if you want to copy something from the checkpoint you made three hours ago? What if you forgot to copy the checkpoint? Preparing for all of these eventualities leads to more and more complicated practices of saving and backing up your code. Eventually, you might find that you are annotating your checkpoints with little messages describing what exactly you've done since the last one.

* What is the difference between git and GitHub?
:PROPERTIES:
:ID:       c03860a9-313f-4143-b28e-185d338f8a2a
:END:
While ~git~ is the underlying software that performs version control, [[https:github.com][Github]] is a website where users can host and collaborate on their repositories. Github provides many additional features such as /issues/ for repositories where users can file bug reports or make feature requests, /code reviews/ where users can provide feedback on each others code, and /project boards/ which can help teams of developers to coordinate their work.  Github also provides a framework to give developers easier access to various tools such as /continuous integration servers/ and app hosting.
