index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
  <!-- 2021-01-10 Sun 20:27 -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii" />
  <meta name="viewport" content=
  "width=device-width, initial-scale=1" />

  <title>Yet Another Git Primer</title>
  <meta name="generator" content="Org mode" />
  <meta name="author" content="Rik Bose" />
  <link rel="stylesheet" type="text/css" href=
  "https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css" />
  <link rel="stylesheet" type="text/css" href=
  "https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css" />

</head>

<body>
  <div id="content">
    <h1 class="title">Yet Another Git Primer</h1>

    <div id="table-of-contents">
      <h2>Table of Contents</h2>

      <div id="text-table-of-contents">
        <ul>
          <li>
            <a href="#orgfb0585c">What is git and why should we use
            it?</a>

            <ul>
              <li><a href="#org926c7db">Motivation:
              Checkpoints</a></li>
            </ul>
          </li>

          <li><a href="#org074587d">What is the difference between
          git and GitHub?</a></li>

          <li><a href="#orgc7f5792">Anatomy of a git repo</a></li>

          <li>
            <a href="#orgc8f2151">Basic Operations</a>

            <ul>
              <li><a href="#orgdd18bea">Copying a repo -
              <code>clone</code></a></li>

              <li><a href="#orgf1e0521">Creating a repo -
              <code>init</code></a></li>

              <li><a href="#orgebed50f">Staging -
              <code>add</code></a></li>

              <li><a href="#org2cc2014">Commit -
              <code>commit</code></a></li>

              <li>
                <a href="#orgcf7fa90">Receive -
                <code>fetch/pull</code></a>

                <ul>
                  <li><a href="#org5e8ab6c">Conflicts</a></li>
                </ul>
              </li>

              <li>
                <a href="#orgb3503f6">Send - <code>push</code></a>

                <ul>
                  <li><a href="#org25c1d90">Conflicts</a></li>
                </ul>
              </li>
            </ul>
          </li>

          <li>
            <a href="#org8cf41d9">Branching and Merging</a>

            <ul>
              <li><a href="#org6d0f145">A sample branching
              paradigm</a></li>

              <li><a href="#org838fe53">Creating branches -
              <code>branch</code></a></li>

              <li><a href="#org8759537">Exploratory -
              <code>checkout</code></a></li>

              <li><a href="#orgbada2e4">Conflicts!</a></li>

              <li><a href="#org4dd0401">Pull Requests</a></li>
            </ul>
          </li>

          <li>
            <a href="#orgb5fc2b8">Undoing things</a>

            <ul>
              <li><a href="#org9a76f55">Temporary -
              <code>stash</code></a></li>

              <li><a href="#orgcfef600">UNDO! UNDO!! -
              <code>revert</code></a></li>
            </ul>
          </li>

          <li>
            <a href="#org8b82158">Hints and FAQs</a>

            <ul>
              <li>
                <a href="#org4eca2fe">Some strategies to avoid
                panic.</a>

                <ul>
                  <li><a href="#org5a6bc39">Commit
                  messages</a></li>

                  <li><a href="#orga5ad166">Work on your own
                  branch</a></li>

                  <li><a href="#org3ebd5c7">Test before you
                  merge</a></li>

                  <li><a href="#org7a1f6af">Avoiding
                  Conflicts</a></li>
                </ul>
              </li>

              <li><a href="#orga7e20aa">Help, I need to remove a
              file from the repository!</a></li>

              <li><a href="#orgae655b8">Help, I staged a file for
              commit but I don&rsquo;t want to commit it!</a></li>
            </ul>
          </li>
        </ul>
      </div>
    </div>

    <div id="outline-container-orgfb0585c" class="outline-2">
      <h2 id="orgfb0585c">What is git and why should we use
      it?</h2>

      <div class="outline-text-2" id="text-orgfb0585c">
        <div class="org-center">
          nil
        </div>

        <p>When you&rsquo;re working on a file or a document, it is
        important to save frequently in order to make sure you
        don&rsquo;t lose your work. But code is complicated. The
        development of code is not linear - often edits are
        exploratory and end up being reverted. You find quickly
        that what you want to be able to save and explore is not
        the actual state of your files, but the sequence of edits
        you&rsquo;ve made. <code>git</code> saves your project as a
        sequence of edits to your code base rather than a set of
        file contents.</p>
      </div>

      <div id="outline-container-org926c7db" class="outline-3">
        <h3 id="org926c7db">Motivation: Checkpoints</h3>

        <div class="outline-text-3" id="text-org926c7db">
          <p>You have been writing code for hours. You&rsquo;ve got
          into a good flow. What started off as a few functions in
          a single file has expanded into dozens of functions and
          classes in half a dozen files each consisting of several
          hundred lines of code. At least. You save the latest line
          you wrote. After The Great Cherry Coke Debacle in
          freshman year where you lost two pages of your final
          paper hours before the deadline, you&rsquo;re very
          diligent about saving. But it has started to occur to you
          - not all saves are created equal. Saving code might have
          one of several purposes:</p>

          <ul class="org-ul">
            <li>To ensure that you don&rsquo;t lose what
            you&rsquo;ve done.</li>

            <li>To compile and run your code as a sanity
            check.</li>

            <li>To mark a checkpoint in your progress - a version
            of your code to backup and come back to if things
            break.</li>
          </ul>

          <p>In a smaller, simpler project, you might have just
          copied the code into a different folder now and then. But
          what if you want to go back several checkpoints? or what
          if you forget? What if you want to copy something from
          the checkpoint you made three hours ago? What if you
          forgot to copy the checkpoint? Preparing for all of these
          eventualities leads to more and more complicated
          practices of saving and backing up your code. Eventually,
          you might find that you are annotating your checkpoints
          with little messages describing what exactly you&rsquo;ve
          done since the last one.</p>
        </div>
      </div>
    </div>

    <div id="outline-container-org074587d" class="outline-2">
      <h2 id="org074587d">What is the difference between git and
      GitHub?</h2>

      <div class="outline-text-2" id="text-org074587d">
        <p>While <code>git</code> is the underlying software that
        performs version control, <a href=
        "https:github.com">Github</a> is a website where users can
        host and collaborate on their repositories. Github provides
        many additional features such as <i>issues</i> for
        repositories where users can file bug reports or make
        feature requests, <i>code reviews</i> where users can
        provide feedback on each others code, and <i>project
        boards</i> which can help teams of developers to coordinate
        their work. Github also provides a framework to give
        developers easier access to various tools such as
        <i>continuous integration servers</i> and app hosting.</p>
      </div>
    </div>
