git-primer.org
* Anatomy of a git repo
A git repository, or repo for short, is just a normal folder with a subfolder named =.git/= containing metadata. The =.git= folder will contain information about previous commits, branches, and where the remote repos are located. Most repos will also contain one or more files called =.gitignore=. A =.gitignore= file tells git which files to skip adding to the repository. You might add things like =*.class= files in /Java/ or =*.o= files for /C/ projects to your =.gitignore= file. Repos hosted on Github might also have a =.github= folder to store configuration of Github specific features.

If you open a repo folder in a file browser, you might not see some of these files or folders because the prefix =.= on a filename is an instruction to many operating systems to keep a file hidden. Many developer tools use /"dotfiles"/ to store user settings invisibly. Most file explorers have options to make all files, including dotfiles, visible.

Conceptually, there are three parts to the git repo. The /working directory/ are the current state of the files in your repository. The /staging index/ stores the the current /uncommitted/ changes to the repo. Finally, the /commit history/ stores all the incremental updates to the repository.

# If you're working in a team, each person will have their own copy of the repo. This ensures that everyone's repo has the same /commit history/.
The set of all the commits that have been added to the repository is called the /commit history/. When people =clone= the repository or =pull= to update their local copy with changes from the remote, they get a copy of the /commit history/. Each commit will have a unique reference which is shared across everyone's copy of the repository, allowing your teammates to all jump to a specific commit across different machines. Of course, you'll have to =add=, =commit=, and =push= your changes to the remote before your teammates will be able see them! Below, we'll discuss how to do that.

#+begin_verse
Commands in this primer are referenced by name. If you want to use these commands in the terminal, you will have to preface them with =git=. So =push= becomes =git push= in the terminal. If you are using a git client, like [[https://desktop.github.com][Github Desktop]] or [[https://gitkraken.com][GitKraken]], this primer tells you which command to look for.
#+end_verse

* Basic Operations
In this section, we will outline the basic operations for interacting with git repos
** Copying a repo - =clone=
In order to use an existing repo, you must first /clone/ it to your local machine. The =clone= command takes the location of a repo and copies it to your local directory along with all the repo's history. The location provided to the /clone/ command can either be an url for a remote repository or a file path, if you want to make a copy of a repository already on your computer. The cloned repo will automatically store the /source/ repo as the /origin/, so you can send back your changes.
** Creating a repo - =init=
To create a repo, you would perform a =init=. This creates a =.git= folder inside the current directory, making it the base directory of your new repo. At this stage, the repo considers itself to be empty. Even if there are files already in your directory, they won't be added to the repository until you explicitly start /tracking/ them. In order to start /tracking/ a file, you'll have to =add= and =commit= it to the repo. A repo created like this will have no remote target[fn:remote] to push changes to. Information about remotes and what files are being tracked are all stored in the =.git= folder.
** Staging - =add=
Once you've created or cloned your repo and edited some files, you will want to add your changes to the repo's history. This is a two step process. The first step is to /stage/ your changes. You can choose which files[fn:advanced-staging] you want to add to your repo. During this process, you can stage or unstage changes as you wish - nothing gets saved permanently until the next step.
** Commit - =commit=
To make your changes (semi) permanent, you make a commit. In addition to staged changes, a commit requires a commit message describing its contents. It is important to leave descriptive commit messages so you and your collaborators can more easily go back and track what was changed, when, and by whom if something goes wrong.
Since commits are a `unit' in git repo, you may want to split a set of your latest code changes into multiple commits For example, grouping your commits by feature would allow you to better trace issues or remove features later on. Just as with saving, it is good practice to commit often[fn:squashing]. The commit gets assigned a unique reference which can be used in other commands.
** Receive - =fetch/pull=
Performing a =fetch= checks the remote repository for any updates that have been sent by others (or by you from other machines) that aren't present in your copy of the repo.
In order to actually get the changes, you would perform a =pull=. This gathers all updates to the remote repo since your last =pull= and sends them to you, ensuring that your view of the repo is up to date.
*** Conflicts
In some cases, the commits on the remote server may overlap with your own changes. If this is the case when you =pull=, you'll be prompted to perform a =merge=. Merges can be stresfull and we'll talk about them in more detail a little later. We will also discuss some strategies to avoid unnecessary merging.
#+begin_verse
Since =fetch= only checks for changes, performing a =fetch= before you =pull= can tell you whether you need to prepare for a =merge=.
#+end_verse
