index.html

    <div id="outline-container-orgc7f5792" class="outline-2">
      <h2 id="orgc7f5792">Anatomy of a git repo</h2>

      <div class="outline-text-2" id="text-orgc7f5792">
        <p>A git repository, or repo for short, is just a normal
        folder with a subfolder named <code>.git/</code> containing
        metadata. The <code>.git</code> folder will contain
        information about previous commits, branches, and where the
        remote repos are located. Most repos will also contain one
        or more files called <code>.gitignore</code>. A
        <code>.gitignore</code> file tells git which files to skip
        adding to the repository. You might add things like
        <code>*.class</code> files in <i>Java</i> or
        <code>*.o</code> files for <i>C</i> projects to your
        <code>.gitignore</code> file. Repos hosted on Github might
        also have a <code>.github</code> folder to store
        configuration of Github specific features.</p>

        <p>If you open a repo folder in a file browser, you might
        not see some of these files or folders because the prefix
        <code>.</code> on a filename is an instruction to many
        operating systems to keep a file hidden. Many developer
        tools use <i>&ldquo;dotfiles&rdquo;</i> to store user
        settings invisibly. Most file explorers have options to
        make all files, including dotfiles, visible.</p>

        <p>Conceptually, there are three parts to the git repo. The
        <i>working directory</i> are the current state of the files
        in your repository. The <i>staging index</i> stores the the
        current <i>uncommitted</i> changes to the repo. Finally,
        the <i>commit history</i> stores all the incremental
        updates to the repository.</p>

        <p>The set of all the commits that have been added to the
        repository is called the <i>commit history</i>. When people
        <code>clone</code> the repository or <code>pull</code> to
        update their local copy with changes from the remote, they
        get a copy of the <i>commit history</i>. Each commit will
        have a unique reference which is shared across
        everyone&rsquo;s copy of the repository, allowing your
        teammates to all jump to a specific commit across different
        machines. Of course, you&rsquo;ll have to <code>add</code>,
        <code>commit</code>, and <code>push</code> your changes to
        the remote before your teammates will be able see them!
        Below, we&rsquo;ll discuss how to do that.</p>

        <p class="verse">Commands in this primer are referenced by
        name. If you want to use these commands in the terminal,
        you will have to preface them with <code>git</code>. So
        <code>push</code> becomes <code>git push</code> in the
        terminal. If you are using a git client, like <a href=
        "https://desktop.github.com">Github Desktop</a> or <a href=
        "https://gitkraken.com">GitKraken</a>, this primer tells
        you which command to look for.<br /></p>
      </div>
    </div>

    <div id="outline-container-orgc8f2151" class="outline-2">
      <h2 id="orgc8f2151">Basic Operations</h2>

      <div class="outline-text-2" id="text-orgc8f2151">
        <p>In this section, we will outline the basic operations
        for interacting with git repos</p>
      </div>

      <div id="outline-container-orgdd18bea" class="outline-3">
        <h3 id="orgdd18bea">Copying a repo -
        <code>clone</code></h3>

        <div class="outline-text-3" id="text-orgdd18bea">
          <p>In order to use an existing repo, you must first
          <i>clone</i> it to your local machine. The
          <code>clone</code> command takes the location of a repo
          and copies it to your local directory along with all the
          repo&rsquo;s history. The location provided to the
          <i>clone</i> command can either be an url for a remote
          repository or a file path, if you want to make a copy of
          a repository already on your computer. The cloned repo
          will automatically store the <i>source</i> repo as the
          <i>origin</i>, so you can send back your changes.</p>
        </div>
      </div>

      <div id="outline-container-orgf1e0521" class="outline-3">
        <h3 id="orgf1e0521">Creating a repo -
        <code>init</code></h3>

        <div class="outline-text-3" id="text-orgf1e0521">
          <p>To create a repo, you would perform a
          <code>init</code>. This creates a <code>.git</code>
          folder inside the current directory, making it the base
          directory of your new repo. At this stage, the repo
          considers itself to be empty. Even if there are files
          already in your directory, they won&rsquo;t be added to
          the repository until you explicitly start <i>tracking</i>
          them. In order to start <i>tracking</i> a file,
          you&rsquo;ll have to <code>add</code> and
          <code>commit</code> it to the repo. A repo created like
          this will have no remote target<sup><a id="fnr.1" class=
          "footref" href="#fn.1" name="fnr.1">1</a></sup> to push
          changes to. Information about remotes and what files are
          being tracked are all stored in the <code>.git</code>
          folder.</p>
        </div>
      </div>

      <div id="outline-container-orgebed50f" class="outline-3">
        <h3 id="orgebed50f">Staging - <code>add</code></h3>

        <div class="outline-text-3" id="text-orgebed50f">
          <p>Once you&rsquo;ve created or cloned your repo and
          edited some files, you will want to add your changes to
          the repo&rsquo;s history. This is a two step process. The
          first step is to <i>stage</i> your changes. You can
          choose which files<sup><a id="fnr.2" class="footref"
          href="#fn.2" name="fnr.2">2</a></sup> you want to add to
          your repo. During this process, you can stage or unstage
          changes as you wish - nothing gets saved permanently
          until the next step.</p>
        </div>
      </div>

      <div id="outline-container-org2cc2014" class="outline-3">
        <h3 id="org2cc2014">Commit - <code>commit</code></h3>

        <div class="outline-text-3" id="text-org2cc2014">
          <p>To make your changes (semi) permanent, you make a
          commit. In addition to staged changes, a commit requires
          a commit message describing its contents. It is important
          to leave descriptive commit messages so you and your
          collaborators can more easily go back and track what was
          changed, when, and by whom if something goes wrong. Since
          commits are a `unit&rsquo; in git repo, you may want to
          split a set of your latest code changes into multiple
          commits For example, grouping your commits by feature
          would allow you to better trace issues or remove features
          later on. Just as with saving, it is good practice to
          commit often<sup><a id="fnr.3" class="footref" href=
          "#fn.3" name="fnr.3">3</a></sup>. The commit gets
          assigned a unique reference which can be used in other
          commands.</p>
        </div>
      </div>

      <div id="outline-container-orgcf7fa90" class="outline-3">
        <h3 id="orgcf7fa90">Receive - <code>fetch/pull</code></h3>

        <div class="outline-text-3" id="text-orgcf7fa90">
          <p>Performing a <code>fetch</code> checks the remote
          repository for any updates that have been sent by others
          (or by you from other machines) that aren&rsquo;t present
          in your copy of the repo. In order to actually get the
          changes, you would perform a <code>pull</code>. This
          gathers all updates to the remote repo since your last
          <code>pull</code> and sends them to you, ensuring that
          your view of the repo is up to date.</p>
        </div>

        <div id="outline-container-org5e8ab6c" class="outline-4">
          <h4 id="org5e8ab6c">Conflicts</h4>

          <div class="outline-text-4" id="text-org5e8ab6c">
            <p>In some cases, the commits on the remote server may
            overlap with your own changes. If this is the case when
            you <code>pull</code>, you&rsquo;ll be prompted to
            perform a <code>merge</code>. Merges can be stresfull
            and we&rsquo;ll talk about them in more detail a little
            later. We will also discuss some strategies to avoid
            unnecessary merging.</p>

            <p class="verse">Since <code>fetch</code> only checks
            for changes, performing a <code>fetch</code> before you
            <code>pull</code> can tell you whether you need to
            prepare for a <code>merge</code>.<br /></p>
          </div>
        </div>
      </div>
