git-primer.org
** Send - =push=
Once you've made one or more commits, you'll want to synchronize them with your remote repo. In order to do this, you'll need to perform a =push=. Pushing sends your revisions to the remote repository and makes them available for other users to add.

#+begin_verse
In general, synchronizing with the remote regularly (=push= and =pull=) will reduce the likelihood of requiring a =merge=. There might be an occassional reason to refrain from a =push= - perhaps other members of your team are in the midst of resolving some issue on the branch you've been working on and you don't want to add to the chaos just yet. Some advanced git users will clean up their local commit history and by combining commits or rewriting the commit messages before pushing them to the remote.
#+end_verse

*** Conflicts
Sometimes as you try to push, your remote repository will notify you that it has received a push from someone else since you last pulled from the repo. In situations like this, the remote repository will ask you to perform a =pull= first. You might see an error like this:

#+begin_src bash
! [rejected]        master -> master (fetch first)
error: failed to push some refs to 'https://github.com/mrmechko/repo.git'
hint: Updates were rejected because the remote contains work that you do
hint: not have locally. This is usually caused by another repository pushing
hint: to the same ref. You may want to first integrate the remote changes
hint: (e.g., 'git pull ...') before pushing again.
hint: See the 'Note about fast-forwards' in 'git push --help' for details.
#+end_src

This is a safety measure. This way, if there are any issues surrounding integrating your changes with your collaborator's changes, you can resolve them yourself. We will discuss how to handle conflicts below.

* Branching and Merging
# xkcd:1667

A key features of git repos is the ability to create a branch of your code. Branches allow you switch between and develop multiple versions of your code simultaneously. If we decide that we want to combine two branches, we can perform a =merge=.
Merging includes all the commits from one branch into another and then caps them off with a special merge commit to indicate that the two branches have been combined. This special merge commit can be used to resolve any conflicts that might have arisen. We will talk about merge conflicts a little later.

The most common use for branches would be developing a new feature for a piece of software with an existing stable version. You don't want to add unstable code to the version that other people might be using, so you can make a branch to work on your feature until it is ready. As mentioned previously, a git repo stores the history as a sequence of /changes/ to repo, not as files. That means in many cases changes made to code by different people can be automatically combined by git. This does /NOT/ mean that the combined files will work! Make sure you test your code after every =merge= (and before every =push=).

#+begin_verse
Your git repo has a =HEAD= pointer which refers to the revision/commit you're currently working on. When you switch to a branch, your =HEAD= pointer automatically gets moved to the latest commit on that branch.
#+end_verse

** A sample branching paradigm
Most repositories have a single branch to start with, called =main=[fn:master]. This branch should contain the most recent `released' version of your software. In early the early stages of development, of course, it might not be a finished product. Next, you might create a branch called =develop= to track less stable improvements to the software. Individual features will spawn their own branches off of =develop= and be merged back into =develop= as they are completed. When the team is sufficiently sure that the code on =develop= is ready for release, it can be pushed to =main=.

In order to make the most of this paradigm for branching, it is a good idea to set /milestones/ which lists a set of features and fixes that are required before the next release. Features that do not contribute to the next milestone are left un-merged

#+begin_quote
When you perform a =merge=, you are taking commits from another branch and adding them to the branch you are currently on. For example, if you want the branch =main= to include changes made in =my-cool-feature-branch=, you would have to first checkout =main= and then /merge/ =my-cool-feature-branch= into =main=.
#+end_quote

** Creating branches - =branch=
=branch= allows you to create a new branch from the commit you are currently working on. This does not create any new commits[fn:branch-commit]. Instead, you just move your =HEAD= pointer to the existing commit. Once you've created the new branch, you will need to switch to the branch by performing a =checkout --branch= to switch your =HEAD= pointer to the tip of the branch and make sure any future commits get added there.

** [#B] Exploratory - =checkout=
A =checkout= takes a commit reference and sets your /working directory/ state to that commit. =checkout --branch= can be used to switch to a different branch.

#+begin_verse
If you checkout a specific commit instead of a branch, you might get a scary looking message informing you that you are in a ~detached HEAD state~. [[https://www.cloudbees.com/blog/git-detached-head][This]] is a good guide explaining how to handle this.
#+end_verse

