index.html

      <div id="outline-container-orgb3503f6" class="outline-3">
        <h3 id="orgb3503f6">Send - <code>push</code></h3>

        <div class="outline-text-3" id="text-orgb3503f6">
          <p>Once you&rsquo;ve made one or more commits,
          you&rsquo;ll want to synchronize them with your remote
          repo. In order to do this, you&rsquo;ll need to perform a
          <code>push</code>. Pushing sends your revisions to the
          remote repository and makes them available for other
          users to add.</p>

          <p class="verse">In general, synchronizing with the
          remote regularly (<code>push</code> and
          <code>pull</code>) will reduce the likelihood of
          requiring a <code>merge</code>. There might be an
          occassional reason to refrain from a <code>push</code> -
          perhaps other members of your team are in the midst of
          resolving some issue on the branch you&rsquo;ve been
          working on and you don&rsquo;t want to add to the chaos
          just yet. Some advanced git users will clean up their
          local commit history and by combining commits or
          rewriting the commit messages before pushing them to the
          remote.<br /></p>
        </div>

        <div id="outline-container-org25c1d90" class="outline-4">
          <h4 id="org25c1d90">Conflicts</h4>

          <div class="outline-text-4" id="text-org25c1d90">
            <p>Sometimes as you try to push, your remote repository
            will notify you that it has received a push from
            someone else since you last pulled from the repo. In
            situations like this, the remote repository will ask
            you to perform a <code>pull</code> first. You might see
            an error like this:</p>

            <div class="org-src-container">
              <pre class="src src-bash">
<span style=
"color: #51afef; font-weight: bold;">!</span> <span style=
"color: #51afef;">[</span>rejected<span style=
"color: #51afef;">]</span>        master -&gt; master <span style=
"color: #51afef;">(</span>fetch first<span style=
"color: #51afef;">)</span>
error: failed to push some refs to <span style=
"color: #98be65;">'https://github.com/mrmechko/repo.git'</span>
hint: Updates were rejected because the remote contains work that you do
hint: not have locally. This is usually caused by another repository pushing
hint: to the same ref. You may want to first integrate the remote changes
hint: <span style="color: #51afef;">(</span>e.g., <span style=
"color: #98be65;">'</span><span style=
"color: #98be65;">git</span><span style=
"color: #98be65;"> pull ...'</span><span style=
"color: #51afef;">)</span> before pushing again.
hint: See the <span style=
"color: #98be65;">'Note about fast-forwards'</span><span style=
"color: #51afef;"> in</span> <span style=
"color: #98be65;">'</span><span style=
"color: #98be65;">git</span><span style=
"color: #98be65;"> push --help'</span> for details.
</pre>
            </div>

            <p>This is a safety measure. This way, if there are any
            issues surrounding integrating your changes with your
            collaborator&rsquo;s changes, you can resolve them
            yourself. We will discuss how to handle conflicts
            below.</p>
          </div>
        </div>
      </div>
    </div>

    <div id="outline-container-org8cf41d9" class="outline-2">
      <h2 id="org8cf41d9">Branching and Merging</h2>

      <div class="outline-text-2" id="text-org8cf41d9">
        <p>A key features of git repos is the ability to create a
        branch of your code. Branches allow you switch between and
        develop multiple versions of your code simultaneously. If
        we decide that we want to combine two branches, we can
        perform a <code>merge</code>. Merging includes all the
        commits from one branch into another and then caps them off
        with a special merge commit to indicate that the two
        branches have been combined. This special merge commit can
        be used to resolve any conflicts that might have arisen. We
        will talk about merge conflicts a little later.</p>

        <p>The most common use for branches would be developing a
        new feature for a piece of software with an existing stable
        version. You don&rsquo;t want to add unstable code to the
        version that other people might be using, so you can make a
        branch to work on your feature until it is ready. As
        mentioned previously, a git repo stores the history as a
        sequence of <i>changes</i> to repo, not as files. That
        means in many cases changes made to code by different
        people can be automatically combined by git. This does
        <i>NOT</i> mean that the combined files will work! Make
        sure you test your code after every <code>merge</code> (and
        before every <code>push</code>).</p>

        <p class="verse">Your git repo has a <code>HEAD</code>
        pointer which refers to the revision/commit you&rsquo;re
        currently working on. When you switch to a branch, your
        <code>HEAD</code> pointer automatically gets moved to the
        latest commit on that branch.<br /></p>
      </div>

      <div id="outline-container-org6d0f145" class="outline-3">
        <h3 id="org6d0f145">A sample branching paradigm</h3>

        <div class="outline-text-3" id="text-org6d0f145">
          <p>Most repositories have a single branch to start with,
          called <code>main</code><sup><a id="fnr.4" class=
          "footref" href="#fn.4" name="fnr.4">4</a></sup>. This
          branch should contain the most recent `released&rsquo;
          version of your software. In early the early stages of
          development, of course, it might not be a finished
          product. Next, you might create a branch called
          <code>develop</code> to track less stable improvements to
          the software. Individual features will spawn their own
          branches off of <code>develop</code> and be merged back
          into <code>develop</code> as they are completed. When the
          team is sufficiently sure that the code on
          <code>develop</code> is ready for release, it can be
          pushed to <code>main</code>.</p>

          <p>In order to make the most of this paradigm for
          branching, it is a good idea to set <i>milestones</i>
          which lists a set of features and fixes that are required
          before the next release. Features that do not contribute
          to the next milestone are left un-merged</p>

          <blockquote>
            <p>When you perform a <code>merge</code>, you are
            taking commits from another branch and adding them to
            the branch you are currently on. For example, if you
            want the branch <code>main</code> to include changes
            made in <code>my-cool-feature-branch</code>, you would
            have to first checkout <code>main</code> and then
            <i>merge</i> <code>my-cool-feature-branch</code> into
            <code>main</code>.</p>
          </blockquote>
        </div>
      </div>

      <div id="outline-container-org838fe53" class="outline-3">
        <h3 id="org838fe53">Creating branches -
        <code>branch</code></h3>

        <div class="outline-text-3" id="text-org838fe53">
          <p><code>branch</code> allows you to create a new branch
          from the commit you are currently working on. This does
          not create any new commits<sup><a id="fnr.5" class=
          "footref" href="#fn.5" name="fnr.5">5</a></sup>. Instead,
          you just move your <code>HEAD</code> pointer to the
          existing commit. Once you&rsquo;ve created the new
          branch, you will need to switch to the branch by
          performing a <code>checkout --branch</code> to switch
          your <code>HEAD</code> pointer to the tip of the branch
          and make sure any future commits get added there.</p>
        </div>
      </div>

      <div id="outline-container-org8759537" class="outline-3">
        <h3 id="org8759537">Exploratory -
        <code>checkout</code></h3>

        <div class="outline-text-3" id="text-org8759537">
          <p>A <code>checkout</code> takes a commit reference and
          sets your <i>working directory</i> state to that commit.
          <code>checkout --branch</code> can be used to switch to a
          different branch.</p>

          <p class="verse">If you checkout a specific commit
          instead of a branch, you might get a scary looking
          message informing you that you are in a <code>detached
          HEAD state</code>. <a href=
          "https://www.cloudbees.com/blog/git-detached-head">This</a>
          is a good guide explaining how to handle this.<br /></p>
        </div>
      </div>
