git-primer.org
** Conflicts!
# xkcd:722

When pulling or merging changes from other branches, from time to time you will come across conflicts. These occur when two commits change the same line in a file. Merge conflicts are one of the most panic-inducing events associated with git. It is important to remember that all your work is safe as long as you've been committing regularly.

In the event that a segment of code has a conflict during a merge, that segment will be replaced with both versions of the code with in-text annotations to indicate the conflict. Below is an example of a conflict when merging =other-branch= into =main=. Note the line of ~=~'s separating the two alternatives.

#+BEGIN_SRC
This line does not have a conflict.
<<<<<<< main
this line has a conflict.
=======
This line is a conflict.
>>>>>>> other-branch;
#+END_SRC

If we were to look at the state of =main= before the merge began, we would see this:

#+BEGIN_SRC
This line does not have a conflict.
this line has a conflict.
#+END_SRC

Similarly, if we were to look at the state of =other-branch= before the merge began, we would see this:

#+BEGIN_SRC
This line does not have a conflict.
This line is a conflict.
#+END_SRC

In order to resolve the conflict, you need to edit each file with a conflict in it and remove the conflict markers. Each conflict in delimited by three lines:
a. =<<<<<<< main=
b. ~=======~
c. =>>>>>>> other-branch=
The text between lines =a= and =b= are the contents of the =main= branch and the text between =b= and =c= are the contents =other-branch=. Most times, you'll just choose either the text in =main= or the text that was in =other-branch=. Occasionally, you might have to choose lines from both or even add additional lines. In some cases you might want to keep some or all of both alternatives.

Once you're done with the edits, make sure to test your code, commit the changes, and you're all done! Remember, there might be more than one conflict in a merge.

#+begin_verse
You can usually find all the conflicts by searching for =<<<<<= in your code base - it is a fairly uncommon string in code!
#+end_verse

** Pull Requests
Pull requests are a special feature provided by some git-hosting services (e.g. [[https://github.com][github]], [[https://gitlab.com][gitlab]]) which help with the latent potential chaos surrounding =merge=. Teams will often write-protect shared branches like =main= or =development= because introducing errors to those branches can be disastrous to the whole team. In such situations, a pull-request might require the approval of multiple team members or of product managers. A pull request allows the team to discuss commits that are requested to be merged into a branch, test the resulting merged code, and to add additional commits to fix any issues, all before the merge occurs.

* Undoing things
Occassionally, you'll discover that a commit introduces errors or the approach you've been taking to solving a problem is far more trouble than it is worth. In situations like this, you might want to undo or discard some changes you've made.
** Temporary - =stash=
=stash= is a very useful command which takes any /uncommitted/ changes you've made to the working directory and stores them safely. You can later =stash pop= to return the changes themselves to the working directory. Note that if you move some changes to your =stash= and then make conflicting changes, then you will have to resolve the conflicts. After you've performed a =stash= to store some changes, you can =pull=, =add=, =commit=, and =merge= as necessary before using =stash pop= to return your changes to the working directory.

#+begin_verse
=stash= is a versatile command that allows you to save multiple uncommitted chunks as =WIP= or /work-in-progress/. You can navigate the list of stashed modifications using =stash list= and select a specific one to restore using =stash apply=. You can even give you stashed modifications descriptive commit messages.
#+end_verse

** UNDO! UNDO!! - =revert=
Since each commit in git is a 'change', the natural way to undo things is to make the opposite change. =revert= will construct the inverse of a specific revision and commit it. This is great for two reasons. First, you haven't altered the /commit history/ - just added to it. Second, you can target a specific commit from several days ago without undoing all the work you've done since!

* Hints and FAQs
** Some strategies to avoid panic.
*** Commit messages
# xkcd:1296
# xkcd:2200

Take the extra few minutes to write a complete commit message. Your teammates and future self will thank you. Writing good commit messages is a practiced art. An ideal commit message has a short one line header and then a body that describes the the changes in more detail. Consider going over all the files you've changed in the commit and leaving a short summary of what was changed and why.

*** Work on your own branch
Merging your code with someone else's code is one of the more stressful processes when it comes to working in a team. While it is important to make sure your changes remain compatible with your teammates' changes, you might want to avoid integrating partially completed features. By working on separate branches, you avoid issues surrounding merging code until actually necessary. Many teams will perform integration tests on a regular basis to ensure that teammates don't diverge too far. You will still have to perform the merges from time to time, but at least you can minimize the frequency and complexity of unexpected merge conflicts and bugs that manifest from combining different bodies of code.

*** Test before you merge
Having a number of commits between working versions of code is not usually a problem, however, it is a good idea to test your code thoroughly before pushing or merging on a shared branch.

