index.html

      <div id="outline-container-orgbada2e4" class="outline-3">
        <h3 id="orgbada2e4">Conflicts!</h3>

        <div class="outline-text-3" id="text-orgbada2e4">
          <p>When pulling or merging changes from other branches,
          from time to time you will come across conflicts. These
          occur when two commits change the same line in a file.
          Merge conflicts are one of the most panic-inducing events
          associated with git. It is important to remember that all
          your work is safe as long as you&rsquo;ve been committing
          regularly.</p>

          <p>In the event that a segment of code has a conflict
          during a merge, that segment will be replaced with both
          versions of the code with in-text annotations to indicate
          the conflict. Below is an example of a conflict when
          merging <code>other-branch</code> into <code>main</code>.
          Note the line of <code>=</code>&rsquo;s separating the
          two alternatives.</p>
          <pre class="example">
This line does not have a conflict.
&lt;&lt;&lt;&lt;&lt;&lt;&lt; main
this line has a conflict.
=======
This line is a conflict.
&gt;&gt;&gt;&gt;&gt;&gt;&gt; other-branch;
</pre>

          <p>If we were to look at the state of <code>main</code>
          before the merge began, we would see this:</p>
          <pre class="example">
This line does not have a conflict.
this line has a conflict.
</pre>

          <p>Similarly, if we were to look at the state of
          <code>other-branch</code> before the merge began, we
          would see this:</p>
          <pre class="example">
This line does not have a conflict.
This line is a conflict.
</pre>

          <p>In order to resolve the conflict, you need to edit
          each file with a conflict in it and remove the conflict
          markers. Each conflict in delimited by three lines:</p>

          <ol class="org-ol">
            <li><code>&lt;&lt;&lt;&lt;&lt;&lt;&lt; main</code></li>

            <li><code>=======</code></li>

            <li><code>&gt;&gt;&gt;&gt;&gt;&gt;&gt;
            other-branch</code></li>
          </ol>

          <p>The text between lines <code>a</code> and
          <code>b</code> are the contents of the <code>main</code>
          branch and the text between <code>b</code> and
          <code>c</code> are the contents
          <code>other-branch</code>. Most times, you&rsquo;ll just
          choose either the text in <code>main</code> or the text
          that was in <code>other-branch</code>. Occasionally, you
          might have to choose lines from both or even add
          additional lines. In some cases you might want to keep
          some or all of both alternatives.</p>

          <p>Once you&rsquo;re done with the edits, make sure to
          test your code, commit the changes, and you&rsquo;re all
          done! Remember, there might be more than one conflict in
          a merge.</p>

          <p class="verse">You can usually find all the conflicts
          by searching for <code>&lt;&lt;&lt;&lt;&lt;</code> in
          your code base - it is a fairly uncommon string in
          code!<br /></p>
        </div>
      </div>

      <div id="outline-container-org4dd0401" class="outline-3">
        <h3 id="org4dd0401">Pull Requests</h3>

        <div class="outline-text-3" id="text-org4dd0401">
          <p>Pull requests are a special feature provided by some
          git-hosting services (e.g. <a href=
          "https://github.com">github</a>, <a href=
          "https://gitlab.com">gitlab</a>) which help with the
          latent potential chaos surrounding <code>merge</code>.
          Teams will often write-protect shared branches like
          <code>main</code> or <code>development</code> because
          introducing errors to those branches can be disastrous to
          the whole team. In such situations, a pull-request might
          require the approval of multiple team members or of
          product managers. A pull request allows the team to
          discuss commits that are requested to be merged into a
          branch, test the resulting merged code, and to add
          additional commits to fix any issues, all before the
          merge occurs.</p>
        </div>
      </div>
    </div>

    <div id="outline-container-orgb5fc2b8" class="outline-2">
      <h2 id="orgb5fc2b8">Undoing things</h2>

      <div class="outline-text-2" id="text-orgb5fc2b8">
        <p>Occassionally, you&rsquo;ll discover that a commit
        introduces errors or the approach you&rsquo;ve been taking
        to solving a problem is far more trouble than it is worth.
        In situations like this, you might want to undo or discard
        some changes you&rsquo;ve made.</p>
      </div>

      <div id="outline-container-org9a76f55" class="outline-3">
        <h3 id="org9a76f55">Temporary - <code>stash</code></h3>

        <div class="outline-text-3" id="text-org9a76f55">
          <p><code>stash</code> is a very useful command which
          takes any <i>uncommitted</i> changes you&rsquo;ve made to
          the working directory and stores them safely. You can
          later <code>stash pop</code> to return the changes
          themselves to the working directory. Note that if you
          move some changes to your <code>stash</code> and then
          make conflicting changes, then you will have to resolve
          the conflicts. After you&rsquo;ve performed a
          <code>stash</code> to store some changes, you can
          <code>pull</code>, <code>add</code>, <code>commit</code>,
          and <code>merge</code> as necessary before using
          <code>stash pop</code> to return your changes to the
          working directory.</p>

          <p class="verse"><code>stash</code> is a versatile
          command that allows you to save multiple uncommitted
          chunks as <code>WIP</code> or <i>work-in-progress</i>.
          You can navigate the list of stashed modifications using
          <code>stash list</code> and select a specific one to
          restore using <code>stash apply</code>. You can even give
          you stashed modifications descriptive commit
          messages.<br /></p>
        </div>
      </div>

      <div id="outline-container-orgcfef600" class="outline-3">
        <h3 id="orgcfef600">UNDO! UNDO!! - <code>revert</code></h3>

        <div class="outline-text-3" id="text-orgcfef600">
          <p>Since each commit in git is a &rsquo;change&rsquo;,
          the natural way to undo things is to make the opposite
          change. <code>revert</code> will construct the inverse of
          a specific revision and commit it. This is great for two
          reasons. First, you haven&rsquo;t altered the <i>commit
          history</i> - just added to it. Second, you can target a
          specific commit from several days ago without undoing all
          the work you&rsquo;ve done since!</p>
        </div>
      </div>
    </div>

    <div id="outline-container-org8b82158" class="outline-2">
      <h2 id="org8b82158">Hints and FAQs</h2>

      <div class="outline-text-2" id="text-org8b82158"></div>

      <div id="outline-container-org4eca2fe" class="outline-3">
        <h3 id="org4eca2fe">Some strategies to avoid panic.</h3>

        <div class="outline-text-3" id="text-org4eca2fe"></div>

        <div id="outline-container-org5a6bc39" class="outline-4">
          <h4 id="org5a6bc39">Commit messages</h4>

          <div class="outline-text-4" id="text-org5a6bc39">
            <p>Take the extra few minutes to write a complete
            commit message. Your teammates and future self will
            thank you. Writing good commit messages is a practiced
            art. An ideal commit message has a short one line
            header and then a body that describes the the changes
            in more detail. Consider going over all the files
            you&rsquo;ve changed in the commit and leaving a short
            summary of what was changed and why.</p>
          </div>
        </div>

        <div id="outline-container-orga5ad166" class="outline-4">
          <h4 id="orga5ad166">Work on your own branch</h4>

          <div class="outline-text-4" id="text-orga5ad166">
            <p>Merging your code with someone else&rsquo;s code is
            one of the more stressful processes when it comes to
            working in a team. While it is important to make sure
            your changes remain compatible with your
            teammates&rsquo; changes, you might want to avoid
            integrating partially completed features. By working on
            separate branches, you avoid issues surrounding merging
            code until actually necessary. Many teams will perform
            integration tests on a regular basis to ensure that
            teammates don&rsquo;t diverge too far. You will still
            have to perform the merges from time to time, but at
            least you can minimize the frequency and complexity of
            unexpected merge conflicts and bugs that manifest from
            combining different bodies of code.</p>
          </div>
        </div>

        <div id="outline-container-org3ebd5c7" class="outline-4">
          <h4 id="org3ebd5c7">Test before you merge</h4>

          <div class="outline-text-4" id="text-org3ebd5c7">
            <p>Having a number of commits between working versions
            of code is not usually a problem, however, it is a good
            idea to test your code thoroughly before pushing or
            merging on a shared branch.</p>
          </div>
        </div>
