git-primer.org
*** Avoiding Conflicts
The best way to deal with conflicts is to have as few of them as possible. Working on separate branches reduces the frequency with which you'll have to deal with conflicts, but that might open the door to much larger conflicts cropping up down the line. Conflicts will usually only occur when two people are editing the same segment of code. If this is happening, it probably means that two people are working on very closely related features! The best way to avoid conflicts in this case is to communicate with your team before hand and let everyone know what you're working on and collaborate proactively instead of reactively.

** Help, I need to remove a file from the repository!
=git rm= will untrack a file that you have committed to the repository and delete the file from your disk. If you don't want to delete the file altogether, you can use the =git rm --cached= option. The file will be removed from the repo in your next commit but a copy will remain in your working directory. This option is great if you accidentally commit a file containing, say, private notes that don't belong in the team's repository.

** Help, I staged a file for commit but I don't want to commit it!
=reset HEAD [filename]= will reset the index. Your local changes will still be on disk, but the file won't be committed.

** Next Time :noexport:
In the next article, we will discuss some of the additional features GitHub brings to git. Pull requests, issues, project boards, and continuous integration are great tools that allow teams to collaborate more efficiently and painlessly.

[fn:advanced-staging] You can even specify /hunks/ or specific lines of files you want to add.
[fn:remote] You can manually set a remote target using =remote add [name] [url]=. You can also have multiple remote locations, for example, a Github repo for collaboration and a private server where you deploy your code.
[fn:squashing] Sometimes it might feel like committing too often will make the history look messy. There are advanced commands such as =rebase --interactive= which allow you to rewrite the history. This is a dangerous operation and can break things for other people. There are very few ways to completely destroy a git repo and misuse of history rewriting is basically it.
[fn:branch-commit] This is a fine distinction - git has now added information about your new branch, but that information is not stored as a commit. No files have been changed.
[fn:master] The default branch on many repos you see will be called =master=. In a more recent attempt to avoid slave/master metaphors in computer science, Github and many others have encouraged people to use the name =main= instead.
** Comics :noexport:
All comics were taken from the fabulous [[https://xkcd.com][XKCD]].
