index.html

        <div id="outline-container-org7a1f6af" class="outline-4">
          <h4 id="org7a1f6af">Avoiding Conflicts</h4>

          <div class="outline-text-4" id="text-org7a1f6af">
            <p>The best way to deal with conflicts is to have as
            few of them as possible. Working on separate branches
            reduces the frequency with which you&rsquo;ll have to
            deal with conflicts, but that might open the door to
            much larger conflicts cropping up down the line.
            Conflicts will usually only occur when two people are
            editing the same segment of code. If this is happening,
            it probably means that two people are working on very
            closely related features! The best way to avoid
            conflicts in this case is to communicate with your team
            before hand and let everyone know what you&rsquo;re
            working on and collaborate proactively instead of
            reactively.</p>
          </div>
        </div>
      </div>

      <div id="outline-container-orga7e20aa" class="outline-3">
        <h3 id="orga7e20aa">Help, I need to remove a file from the
        repository!</h3>

        <div class="outline-text-3" id="text-orga7e20aa">
          <p><code>git rm</code> will untrack a file that you have
          committed to the repository and delete the file from your
          disk. If you don&rsquo;t want to delete the file
          altogether, you can use the <code>git rm --cached</code>
          option. The file will be removed from the repo in your
          next commit but a copy will remain in your working
          directory. This option is great if you accidentally
          commit a file containing, say, private notes that
          don&rsquo;t belong in the team&rsquo;s repository.</p>
        </div>
      </div>

      <div id="outline-container-orgae655b8" class="outline-3">
        <h3 id="orgae655b8">Help, I staged a file for commit but I
        don&rsquo;t want to commit it!</h3>

        <div class="outline-text-3" id="text-orgae655b8">
          <p><code>reset HEAD [filename]</code> will reset the
          index. Your local changes will still be on disk, but the
          file won&rsquo;t be committed.</p>
        </div>
      </div>
    </div>

    <div id="footnotes">
      <h2 class="footnotes">Footnotes:</h2>

      <div id="text-footnotes">
        <div class="footdef">
          <sup><a id="fn.1" class="footnum" href="#fnr.1" name=
          "fn.1">1</a></sup>

          <div class="footpara">
            <p class="footpara">You can manually set a remote
            target using <code>remote add [name] [url]</code>. You
            can also have multiple remote locations, for example, a
            Github repo for collaboration and a private server
            where you deploy your code.</p>
          </div>
        </div>

        <div class="footdef">
          <sup><a id="fn.2" class="footnum" href="#fnr.2" name=
          "fn.2">2</a></sup>

          <div class="footpara">
            <p class="footpara">You can even specify <i>hunks</i>
            or specific lines of files you want to add.</p>
          </div>
        </div>

        <div class="footdef">
          <sup><a id="fn.3" class="footnum" href="#fnr.3" name=
          "fn.3">3</a></sup>

          <div class="footpara">
            <p class="footpara">Sometimes it might feel like
            committing too often will make the history look messy.
            There are advanced commands such as <code>rebase
            --interactive</code> which allow you to rewrite the
            history. This is a dangerous operation and can break
            things for other people. There are very few ways to
            completely destroy a git repo and misuse of history
            rewriting is basically it.</p>
          </div>
        </div>

        <div class="footdef">
          <sup><a id="fn.4" class="footnum" href="#fnr.4" name=
          "fn.4">4</a></sup>

          <div class="footpara">
            <p class="footpara">The default branch on many repos
            you see will be called <code>master</code>. In a more
            recent attempt to avoid slave/master metaphors in
            computer science, Github and many others have
            encouraged people to use the name <code>main</code>
            instead.</p>
          </div>
        </div>

        <div class="footdef">
          <sup><a id="fn.5" class="footnum" href="#fnr.5" name=
          "fn.5">5</a></sup>

          <div class="footpara">
            <p class="footpara">This is a fine distinction - git
            has now added information about your new branch, but
            that information is not stored as a commit. No files
            have been changed.</p>
          </div>
        </div>
      </div>
    </div>
  </div>

  <div id="postamble" class="status">
    <p class="author">Author: Rik Bose</p>

    <p class="date">Created: 2021-01-10 Sun 20:27</p>
  </div>
</body>
</html>
